examples/IndustrialAC-1/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       fluidLutTransport;
    thermo          fluidLutThermo;
    equationOfState fluidLutEOS;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles 1;
        molWeight 1;
    }
    thermodynamics
    {
        #include "dataSiOCO/dataCp.foam";
    }
    transport
    {
        #include "dataSiOCO/dataMu.foam";
        #include "dataSiOCO/dataTk.foam";
        #include "dataSiOCO/dataEk.foam";
    }
    equationOfState
    {
        pRef            101325.;
        #include "dataSiOCO/dataRho.foam";
    }
}

calculateCompositionFieldsYN true;
compositions
{
	#includeIfPresent "dataSiOCO/dataSpecies.foam";
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
