examples/IndustrialAC-1/0.org/ePot
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    volScalarField;
    location "0";
    object   ePot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 2 -3 0 0 -1 0];
internalField uniform 0;
boundaryField
{
    cathode
    {
        type fixedLocationCurrentDensity;
        current table
        (
            (0.000000 0)
            (0.000404 6330)
            (0.000808 12557)
            (0.001212 18583)
            (0.001616 24310)
            (0.002020 29645)
            (0.002424 34504)
            (0.002828 38807)
            (0.003232 42486)
            (0.003636 45482)
            (0.004040 47745)
            (0.004444 49240)
            (0.004848 49943)
            (0.005253 49843)
            (0.005657 48940)
            (0.006061 47250)
            (0.006465 44800)
            (0.006869 41628)
            (0.007273 37787)
            (0.007677 33338)
            (0.008081 28353)
            (0.008485 22911)
            (0.008889 17101)
            (0.009293 11016)
            (0.009697 4753)
            (0.010101 -1586)
            (0.010505 -7900)
            (0.010909 -14087)
            (0.011313 -20047)
            (0.011717 -25684)
            (0.012121 -30908)
            (0.012525 -35635)
            (0.012929 -39788)
            (0.013333 -43301)
            (0.013737 -46118)
            (0.014141 -48192)
            (0.014545 -49491)
            (0.014949 -49994)
            (0.015354 -49692)
            (0.015758 -48591)
            (0.016162 -46707)
            (0.016566 -44073)
            (0.016970 -40729)
            (0.017374 -36730)
            (0.017778 -32139)
            (0.018182 -27032)
            (0.018586 -21490)
            (0.018990 -15602)
            (0.019394 -9463)
            (0.019798 -3171)
            (0.020202 3171)
            (0.020606 9463)
            (0.021010 15602)
            (0.021414 21490)
            (0.021818 27032)
            (0.022222 32139)
            (0.022626 36730)
            (0.023030 40729)
            (0.023434 44073)
            (0.023838 46707)
            (0.024242 48591)
            (0.024646 49692)
            (0.025051 49994)
            (0.025455 49491)
            (0.025859 48192)
            (0.026263 46118)
            (0.026667 43301)
            (0.027071 39788)
            (0.027475 35635)
            (0.027879 30908)
            (0.028283 25684)
            (0.028687 20047)
            (0.029091 14087)
            (0.029495 7900)
            (0.029899 1586)
            (0.030303 -4753)
            (0.030707 -11016)
            (0.031111 -17101)
            (0.031515 -22911)
            (0.031919 -28353)
            (0.032323 -33338)
            (0.032727 -37787)
            (0.033131 -41628)
            (0.033535 -44800)
            (0.033939 -47250)
            (0.034343 -48940)
            (0.034747 -49843)
            (0.035152 -49943)
            (0.035556 -49240)
            (0.035960 -47745)
            (0.036364 -45482)
            (0.036768 -42486)
            (0.037172 -38807)
            (0.037576 -34504)
            (0.037980 -29645)
            (0.038384 -24310)
            (0.038788 -18583)
            (0.039192 -12557)
            (0.039596 -6330)
            (0.040000 0)        
        );
        currentDensity table
        (
            (0.000000 2e7)
            (0.040000 2e7)
        );
        referencePosition (0 0 0.07);
        value uniform 0;
    }
    anode
    {
        type fixedValue;
        value uniform 0;
    }
    sides
    {
        type zeroGradient;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
